DataProcessors/РабочийСтолМенеджераОСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>РабочийСтолМенеджераОСС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПредметыПапкиВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ПредметыПапкиВзаимодействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПапкаЭлектронногоПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПапкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассмотретьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СтатусыСделки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСделки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗадачаИсполнителя</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаСделку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСделку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусЗаявкиCallBack.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусЗаявкиCallBack</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БылиПопыткиДозвониться</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДозвон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусыСделки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованиеЮриста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованиеУПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованиеИБ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтадииЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтадииЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Звонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переговоры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЖилаяНедвижимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммерческаяНедвижимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НежилаяНедвижимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйУчасток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Машиноместо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ЗаявкаНаЗвонок</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqData</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqContact</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыПолученияЗаявокНаCallBack</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаявкиCallBack</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявкиНаЗвонок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявокНаЗвонок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВызова</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВызовов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыРаспределенияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоступленияЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаявковПоВремениПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРаспределения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыРаботыЗавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокДозвониться</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановоеВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыЗаявокНаЗвонок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТестоваяЗаявка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqStatus</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UCID</Name>
					<Comment>Обратный звонок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговоеМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокСегодня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаспределенияЗаявокНаЗвонок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПланированияВстречи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланироваиняВстреч</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеДополнительнойГруппировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоляДополнительныхГруппировокЗаявокНаЗвонок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеCQ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияCQ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/РабочийСтолМенеджераОСС/Forms/_Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ОбновитьНадписиГиперСсылок(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьКоличествоДокументовВЗаголовкахГиперСсылок", 300);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АктуальныеВзаимодействия(Команда)
	
	Если ОтборПоОтветственному Тогда
		Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	Иначе
		Ответственный = ПолучитьОтборПоОтветственному(ПользователиКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
	ПараметрыОткрываемойФормы = Новый Структура("Отбор, Ответственный", Неопределено, Ответственный);	
	ПараметрыОткрываемойФормы.Вставить("УстанавливатьОтборАктуальныеВзаимодействия", Истина); //Новый Структура("Рассмотрено", Ложь)
	
	ФормаСпискаПараметрическая = ПолучитьФорму("ЖурналДокументов.Взаимодействия.Форма.ФормаСпискаПараметрическая", ПараметрыОткрываемойФормы, ЭтотОбъект);
	Если ФормаСпискаПараметрическая.Открыта() Тогда
		ФормаСпискаПараметрическая.Закрыть();
	КонецЕсли;
	//ФормаСпискаПараметрическая.Открыть();  
	
	ОткрытьФорму("ЖурналДокументов.Взаимодействия.Форма.ФормаСпискаПараметрическая", ПараметрыОткрываемойФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершенныеВзаимодействия(Команда)
	
	Если ОтборПоОтветственному Тогда
		Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	Иначе
		Ответственный = ПолучитьОтборПоОтветственному(ПользователиКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
	ПараметрыОткрываемойФормы = Новый Структура("Отбор, Ответственный", Неопределено, Ответственный);
	ПараметрыОткрываемойФормы.Вставить("УстанавливатьОтборЗавершенныеВзаимодействия", Истина);
	
	ФормаСпискаПараметрическая = ПолучитьФорму("ЖурналДокументов.Взаимодействия.Форма.ФормаСпискаПараметрическая", ПараметрыОткрываемойФормы, ЭтотОбъект);
	Если ФормаСпискаПараметрическая.Открыта() Тогда
		ФормаСпискаПараметрическая.Закрыть();
	КонецЕсли;
	//ФормаСпискаПараметрическая.Открыть();  
	
	ОткрытьФорму("ЖурналДокументов.Взаимодействия.Форма.ФормаСпискаПараметрическая", ПараметрыОткрываемойФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеВзаимодействия(Команда)
	
	Если ОтборПоОтветственному Тогда
		Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	Иначе
		Ответственный = ПолучитьОтборПоОтветственному(ПользователиКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
	//Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	
	ПараметрыОткрываемойФормы = Новый Структура("Отбор, Ответственный", Неопределено, Ответственный);		
	ПараметрыОткрываемойФормы.Вставить("УстанавливатьОтборПросроченныеВзаимодействия", Истина);
	
	ФормаСпискаПараметрическая = ПолучитьФорму("ЖурналДокументов.Взаимодействия.Форма.ФормаСпискаПараметрическая", ПараметрыОткрываемойФормы, ЭтотОбъект);
	Если ФормаСпискаПараметрическая.Открыта() Тогда
		ФормаСпискаПараметрическая.Закрыть();
	КонецЕсли;
	//ФормаСпискаПараметрическая.Открыть();
		
	ОткрытьФорму("ЖурналДокументов.Взаимодействия.Форма.ФормаСпискаПараметрическая", ПараметрыОткрываемойФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиОтГПТ(Команда)   
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗаявкиCallBack.НеОбработано"));
	МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗаявкиCallBack.БылиПопыткиДозвониться"));
	
	ПараметрыОткрываемойФормы = Новый Структура("Отбор", Новый Структура("Ответственный,Статус,Проведен",
																			ПользователиКлиентСервер.ТекущийПользователь(),МассивСтатусов,Истина));
	
	ОткрытьФорму("Документ.ЗаявкаНаЗвонок.ФормаСписка", ПараметрыОткрываемойФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаСделкуНаСогласовании(Команда)
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСделки.СогласованиеЮриста"));
	МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСделки.СогласованиеУПН"));	
	
	//ПараметрыОткрываемойФормы = Новый Структура("Отбор", Новый Структура("Проведен, Статус", Истина, МассивСтатусов)); 	
	
	ПараметрыОткрываемойФормы = Новый Структура(); 	
	
	Если ОтборПоОтветственному Тогда 
		ПараметрыОткрываемойФормы.Вставить("Автор", ПользователиКлиентСервер.ТекущийПользователь()); 
	КонецЕсли;
	
	ПараметрыОткрываемойФормы.Вставить("УстанавливатьОтборЗаявкиНаСделкуНаСогласовании", Истина);
	
	ФормаСпискаПараметрическая = ПолучитьФорму("Документ.ЗаявкаНаСделку.ФормаСписка", ПараметрыОткрываемойФормы, ЭтотОбъект);
	Если ФормаСпискаПараметрическая.Открыта() Тогда
		ФормаСпискаПараметрическая.Закрыть();
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаявкаНаСделку.ФормаСписка", ПараметрыОткрываемойФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Шахматка(Команда)
	
	ОткрытьФорму("Отчет.Шахматка.Форма.ФормаОтчета", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочийСтолКлиента(Команда)
	ОткрытьФорму("Обработка.РаботаСКлиентом.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОтчетМенеджера(Команда)
	
	ПараметрыОткрываемойФормы = Новый Структура("Отбор,СформироватьПриОткрытии", 
													Новый Структура("Стадия", ПредопределенноеЗначение("Перечисление.СтадииЗапроса.Переговоры")),
													Истина);
	ОткрытьФорму("Отчет.ОтчетМенеджера.ФормаОбъекта", ПараметрыОткрываемойФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОтветственномуПриИзменении(Элемент)
	
	ОбновитьКоличествоДокументовВЗаголовкахГиперСсылок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоВзаимодействиям(Команда)
	ОткрытьФорму("Отчет.ОтчетПоВзаимодействиям.Форма", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоВыданнымПодаркам(Команда)
	ОткрытьФорму("Отчет.ОтчетПоВыданнымПодаркам.Форма", , ЭтотОбъект);
КонецПроцедуры                                       

&НаКлиенте
Процедура ПодборЗУ(Команда)	
	ОткрытьФорму("Отчет.Квартирограмма.Форма.ФормаПодбора", Новый Структура("Отбор, КлючТекущегоВарианта", Новый Структура("ПроектВидНедвижимости", ПредопределенноеЗначение("Перечисление.ВидыОбъектовНедвижимости.ЗемельныйУчасток")), ОпределитьВариантОтчета()), ЭтотОбъект);	
КонецПроцедуры	

&НаКлиенте
Процедура ОтчетПоВзаимодействиямЗУ(Команда)
	ОткрытьФорму("Отчет.ОтчетПоВзаимодействиямЗУ.Форма.ФормаОтчета", , ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьВариантОтчета()
	
	КлючТекущегоВарианта = "ЗУ";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВариантыОтчетов.Ссылка КАК ВариантСсылка,
	|	ВариантыОтчетов.КлючВарианта КАК КлючВарианта
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.Отчет.Имя = ""Квартирограмма""
	|	И ВариантыОтчетов.Автор = &Автор
	|	И ВариантыОтчетов.Пользовательский
	|	И ВариантыОтчетов.Наименование ПОДОБНО &КлючВарианта
	|	И НЕ ВариантыОтчетов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("КлючВарианта", КлючТекущегоВарианта + "%");
	Запрос.УстановитьПараметр("Автор", ПользователиКлиентСервер.АвторизованныйПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КлючТекущегоВарианта = Выборка.КлючВарианта;	
	КонецЕсли;
	
	Возврат КлючТекущегоВарианта;	
		
КонецФункции

&НаКлиенте
Процедура ОбновитьКоличествоДокументовВЗаголовкахГиперСсылок()

	ОбновитьНадписиГиперСсылок(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктураНаСервере(Менеджер, ОтборПоОтветственному)

	Результат = Новый Структура("ЗапланированныеВзаимодействия, ЗавершенныеВзаимодействия, ПросроченныеВзаимодействия, ЗаявкиОтГПТ, ЗаявкиНаСделку", 0, 0, 0, 0, 0);	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	//Запланированные на текущий день взаимодействия
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взаимодействия.Ссылка) КАК КоличествоДокументов
	|ИЗ
	|	ЖурналДокументов.Взаимодействия КАК Взаимодействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
	|		ПО Взаимодействия.Ссылка = ПредметыПапкиВзаимодействий.Взаимодействие
	|ГДЕ
	|	Взаимодействия.Ответственный В(&Менеджер)
	|	И ЕСТЬNULL(ПредметыПапкиВзаимодействий.РассмотретьПосле, ДАТАВРЕМЯ(1, 1, 1)) МЕЖДУ &НачалоДня И &КонецДня
	|	И ЕСТЬNULL(ПредметыПапкиВзаимодействий.Рассмотрено, ЛОЖЬ) = ЛОЖЬ
	|	И НЕ Взаимодействия.Отменено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взаимодействия.Ссылка) КАК КоличествоДокументов
	|ИЗ
	|	ЖурналДокументов.Взаимодействия КАК Взаимодействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
	|		ПО Взаимодействия.Ссылка = ПредметыПапкиВзаимодействий.Взаимодействие
	|ГДЕ
	|	Взаимодействия.Ответственный В(&Менеджер)
	|	И ЕСТЬNULL(ПредметыПапкиВзаимодействий.РассмотретьПосле, ДАТАВРЕМЯ(1, 1, 1)) МЕЖДУ &НачалоДня И &КонецДня
	|	И ЕСТЬNULL(ПредметыПапкиВзаимодействий.Рассмотрено, ЛОЖЬ) = ИСТИНА
	|	И НЕ Взаимодействия.Отменено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взаимодействия.Ссылка) КАК КоличествоДокументов
	|ИЗ
	|	ЖурналДокументов.Взаимодействия КАК Взаимодействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
	|		ПО Взаимодействия.Ссылка = ПредметыПапкиВзаимодействий.Взаимодействие
	|ГДЕ
	|	Взаимодействия.Автор В(&Менеджер)
	|	И ЕСТЬNULL(ПредметыПапкиВзаимодействий.РассмотретьПосле, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) < &НачалоДня
	|	И ЕСТЬNULL(ПредметыПапкиВзаимодействий.Рассмотрено, ЛОЖЬ) = ЛОЖЬ
	|	И НЕ Взаимодействия.Отменено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаЗвонок.Ссылка) КАК КоличествоДокументов
	|ИЗ
	|	Документ.ЗаявкаНаЗвонок КАК ЗаявкаНаЗвонок
	|ГДЕ
	|	ЗаявкаНаЗвонок.Проведен
	|	И ЗаявкаНаЗвонок.Ответственный В(&Менеджер)
	|	И ЗаявкаНаЗвонок.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусЗаявкиCallBack.НеОбработано), ЗНАЧЕНИЕ(Перечисление.СтатусЗаявкиCallBack.БылиПопыткиДозвониться))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаСделку.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СписокЗаявокНаСделкуПоМенеджеру
	|ИЗ
	|	Документ.ЗаявкаНаСделку КАК ЗаявкаНаСделку
	|ГДЕ
	|	ЗаявкаНаСделку.Проведен
	|	И ЗаявкаНаСделку.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И ЗаявкаНаСделку.Автор В(&Менеджер)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтатусыСделкиСрезПоследних.ЗаявкаНаСделку) КАК КоличествоДокументов
	|ИЗ
	|	РегистрСведений.СтатусыСделки.СрезПоследних(
	|			,
	|			ЗаявкаНаСделку В
	|				(ВЫБРАТЬ
	|					ВТ_СписокЗаявокНаСделкуПоМенеджеру.Ссылка КАК Ссылка
	|				ИЗ
	|					ВТ_СписокЗаявокНаСделкуПоМенеджеру КАК ВТ_СписокЗаявокНаСделкуПоМенеджеру)) КАК СтатусыСделкиСрезПоследних";
	//|ГДЕ
	//|	СтатусыСделкиСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСделки.СогласованиеЮриста), ЗНАЧЕНИЕ(Перечисление.СтатусыСделки.СогласованиеУПН))";
	
	Если ОтборПоОтветственному Тогда
		Запрос.УстановитьПараметр("Менеджер",	Менеджер);
	Иначе
		Запрос.УстановитьПараметр("Менеджер",	ПолучитьОтборПоОтветственному(Менеджер));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЗаявкаНаСделку.Автор В(&Менеджер)", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоДня",	НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецДня",	КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ТекущаяДата()));	
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	//Запланированные на текущий день взаимодействия
	ДобавитьЗначениеВРезультат(РезультатПакета, 0, Результат, "ЗапланированныеВзаимодействия");
	//Завершеные на текущий день взаимодействия
	ДобавитьЗначениеВРезультат(РезультатПакета, 1, Результат, "ЗавершенныеВзаимодействия");
	//Просроченные взаимодействия
	ДобавитьЗначениеВРезультат(РезультатПакета, 2, Результат, "ПросроченныеВзаимодействия");
	//Заявки ГПТ
	ДобавитьЗначениеВРезультат(РезультатПакета, 3, Результат, "ЗаявкиОтГПТ");
	//Заявки на сделку
	ДобавитьЗначениеВРезультат(РезультатПакета, 5, Результат, "ЗаявкиНаСделку");
	
	Возврат Результат;	
	
КонецФункции // ПолучитьСтруктураНаСервере()()

&НаСервереБезКонтекста
Процедура ДобавитьЗначениеВРезультат(РезультатПакета, НомерПакета, Результат, ИмяПараметра)
	
	Если НЕ РезультатПакета[НомерПакета].Пустой() Тогда
		Выборка = РезультатПакета[НомерПакета].Выбрать();
		Выборка.Следующий();
		Результат[ИмяПараметра] = Выборка.КоличествоДокументов;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНадписиГиперСсылок(Форма)

	СтрКоличествоДокументов = ПолучитьСтруктураНаСервере(ПользователиКлиентСервер.ТекущийПользователь(), Форма.ОтборПоОтветственному);
	
	Элементы = Форма.Элементы;
	
	Элементы.АктуальныеВзаимодействия.Заголовок 	= "Запланировано на сегодня (" + СтрКоличествоДокументов.ЗапланированныеВзаимодействия + ")";
	Элементы.ЗавершенныеВзаимодействия.Заголовок 	= "Завершено сегодня (" + СтрКоличествоДокументов.ЗавершенныеВзаимодействия + ")";
	Элементы.ПросроченныйВзаимодействия.Заголовок 	= "Просроченные взаимодействия (" + СтрКоличествоДокументов.ПросроченныеВзаимодействия + ")";	
	Элементы.ЗаявкиОтГПТ.Заголовок 					= "Заявки от ГПТ (" + СтрКоличествоДокументов.ЗаявкиОтГПТ + ")";	
	Элементы.ЗаявкиНаСделкуНаСогласовании.Заголовок	= "Заявки на сделку на согласовании (" + СтрКоличествоДокументов.ЗаявкиНаСделку + ")";

КонецПроцедуры // ОбновитьНадписиГиперссылок()

&НаСервереБезКонтекста
Функция ПолучитьОтборПоОтветственному(Ответственный)
	
	СписокОтбора = Новый СписокЗначений;
	СписокОтбора.Добавить(Ответственный);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ГруппыПользователейСостав.Ссылка КАК Группа
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокОтбора.Добавить(ВыборкаДетальныеЗаписи.Группа);
	КонецЦикла;
	
	Возврат СписокОтбора;
	
КонецФункции
	
#КонецОбласти
